{
    "name": "Football Events",
    "source": "https://www.kaggle.com/datasets/secareanualin/football-events/data",
    "data_intro": "This dataset is a result of a very tiresome effort of webscraping and integrating different data sources. The central element is the text commentary. All the events were derived by reverse engineering the text commentary, using regex. Using this, I was able to derive 11 types of events, as well as the main player and secondary player involved in those events and many other statistics. In case I've missed extracting some useful information, you are gladly invited to do so and share your findings. The dataset provides a granular view of 9,074 games, totaling 941,009 events from the biggest 5 European football (soccer) leagues: England, Spain, Germany, Italy, France from 2011/2012 season to 2016/2017 season as of 25.01.2017.",
    "is_splited": false,
    "overall_size": 951121,
    "train_size": 0,
    "test_size": 0,
    "c_classes": 16,
    "n_classes": 24,
    "cat_feature_intro": {
        "id_odsp": {},
        "id_event": {},
        "text": "- **dictionary.txt** contains a dictionary with the textual description of each categorical variable coded with integers",
        "event_team": {},
        "opponent": {},
        "player": "- How do players compare when they shoot with their week foot versus strong foot? Or which players are ambidextrous?",
        "player2": {},
        "player_in": {},
        "player_out": {},
        "link_odsp": {},
        "date": {},
        "league": "- In which leagues is the referee more likely to give a card?",
        "country": {},
        "ht": {},
        "at": "- Which teams have a bias for attacking on a particular flank?"
    },
    "num_feature_intro": {
        "sort_order": {},
        "time": "- What is the value of a shot? Or what is the probability of a shot being a goal given it's location, shooter, league, assist method, gamestate, number of players on the pitch, time - known as expected goals (xG) models",
        "event_type": {},
        "event_type2": {},
        "side": "Most publicly available football (soccer) statistics are limited to aggregated data such as Goals, Shots, Fouls, Cards. When assessing performance or building predictive models, this simple aggregation, without any context, can be misleading. For example, a team that produced 10 shots on target from long range has a lower chance of scoring than a club that produced the same amount of shots from inside the box. However, metrics derived from this simple count of shots will similarly asses the two teams.",
        "shot_place": {},
        "shot_outcome": {},
        "is_goal": {},
        "location": "- What is the value of a shot? Or what is the probability of a shot being a goal given it's location, shooter, league, assist method, gamestate, number of players on the pitch, time - known as expected goals (xG) models",
        "bodypart": {},
        "assist_method": {},
        "situation": {},
        "fast_break": {},
        "adv_stats": {},
        "season": "There are games that have been played during these seasons for which I could not collect detailed data. Overall, over 90% of the played games during these seasons have event data.",
        "fthg": {},
        "ftag": {},
        "odd_h": {},
        "odd_d": {},
        "odd_a": {},
        "odd_over": {},
        "odd_under": {},
        "odd_bts": {},
        "odd_bts_n": {}
    },
    "evaluation_metric": null
}